In [1]:
import pandas as pd

In [3]:
columns = ["Name", "Height", "Age"]
df = pd.DataFrame(columns=columns)

df

Empty DataFrame
Columns: [Name, Height, Age]
Index: []

In [4]:
df.loc[0] = ["Allen", 175, 22]

In [5]:
df

    Name  Height  Age
0  Allen     175   22

In [9]:
df.loc[1] = ["Ted", 180.5, 25]
df.loc[2] = ["Jack", 183.3, 28]

/var/folders/_k/k5dry95j0q5d35_9pn5d86vm0000gn/T/ipykernel_69415/2085916089.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '180.5' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[1] = ["Ted", 180.5, 25]

In [10]:
df

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   25
2   Jack   183.3   28

In [11]:
df.dtypes

Name       object
Height    float64
Age         int64
dtype: object

In [12]:
df["Name"]

0    Allen
1      Ted
2     Jack
Name: Name, dtype: object

In [13]:
df["Weight"] = [75, 80, 85]

In [14]:
df

    Name  Height  Age  Weight
0  Allen   175.0   22      75
1    Ted   180.5   25      80
2   Jack   183.3   28      85

In [16]:
df.drop("Weight", axis=1)

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   25
2   Jack   183.3   28

In [17]:
df

    Name  Height  Age  Weight
0  Allen   175.0   22      75
1    Ted   180.5   25      80
2   Jack   183.3   28      85

In [18]:
df = df.drop("Weight", axis=1)

In [19]:
df

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   25
2   Jack   183.3   28

In [20]:
df.drop(2)

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   25

In [21]:
df

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   25
2   Jack   183.3   28

In [22]:
df = df.drop(2)
df

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   25

In [23]:
df["Age"] = 30
df

    Name  Height  Age
0  Allen   175.0   30
1    Ted   180.5   30

In [24]:
df2 = df

In [25]:
df2["Age"] = 22
df2

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   22

In [26]:
df

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   22

In [27]:
df3 = df.copy()

In [28]:
df3["Height"] = 180
df3

    Name  Height  Age
0  Allen     180   22
1    Ted     180   22

In [29]:
df

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   22

In [30]:
df.describe()

           Height   Age
count    2.000000   2.0
mean   177.750000  22.0
std      3.889087   0.0
min    175.000000  22.0
25%    176.375000  22.0
50%    177.750000  22.0
75%    179.125000  22.0
max    180.500000  22.0

In [31]:
columns = ["Name", "Height", "Age"]
data = [
    ["Allen", 175, 22],
    ["Ted", 180, 25]
]

df_new = pd.DataFrame(data=data, columns=columns)

df_new

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [32]:
df

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   22

In [33]:
df_new

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [34]:
df_concat = pd.concat([df, df_new])
df_concat

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   22
0  Allen   175.0   22
1    Ted   180.0   25

In [35]:
df_concat.reset_index()

   index   Name  Height  Age
0      0  Allen   175.0   22
1      1    Ted   180.5   22
2      0  Allen   175.0   22
3      1    Ted   180.0   25

In [36]:
df_concat.reset_index(drop=True)

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   22
2  Allen   175.0   22
3    Ted   180.0   25

In [37]:
df_concat = df_concat.reset_index(drop=True)
df_concat

    Name  Height  Age
0  Allen   175.0   22
1    Ted   180.5   22
2  Allen   175.0   22
3    Ted   180.0   25